{
  "uuid": "6b5310945968167ca9d17fa670f5e4ef1c3484ed",
  "text": "Story highlights Rand Paul said, \"So far the Senate leadership is not negotiating with our office\" Sens. Paul, Cruz, Johnson, Lee and Heller oppose the Senate's current bill (CNN) GOP leaders in the Senate are not negotiating with party holdouts on health care, Sen. Rand Paul told CNN Monday.\n\"So far the Senate leadership is not negotiating with our office,\" Paul said in an interview on CNN's \"Newsroom.\" \"I'm trying to negotiate with the President, but really the President is going to have to tell leadership it's going to have to negotiate with some of us who don't see this bill as being good for the country.\" Senate bill: New version unveiled, Cornyn closes 'the door' on extending date to vote What Mitch McConnell is really thinking on healthcare The Kentucky senator said he spoke to President Donald Trump on the phone over the weekend to discuss the Senate's health care proposal. Paul has publicly opposed the bill in its current form along with Sens. Ted Cruz of Texas, Ron Johnson of Wisconsin, Mike Lee of Utah, and Dean Heller of Nevada , who has become the target of a critical advertisement from the pro-Trump group America First Policies. Three more Republican senators -- Susan Collins of Maine, Rob Portman of Ohio and Mike Rounds of South Dakota -- have expressed concerns about the bill; and four others -- Lisa Murkowski of Alaska, Cory Gardner of Colorado, Bill Cassidy of Louisiana and Shelley Moore Capito of West Virginia -- have made specific demands for changes. To pass the bill, the GOP can lose only two senators. Read More Majority Leader Mitch McConnell did not immediately respond to request for comment. Paul spoke to the push for a rapid turnaround on the Senate's proposal, which McConnell has said he wants to vote on before July 4 . Paul said he has not yet finished reading the Senate's newest draft of the bill , released Monday. \"I think it's a lot to digest in one week, not only to read the bill, but we don't even have the CBO score until this afternoon,\" Paul said. Here's where Republican senators stand on the health care bill JUST WATCHED GOP senator targeted for opposing health bill Replay More Videos ... MUST WATCH\nGOP senator targeted for opposing health bill 02:31 The Congressional Budget Office released the score minutes later, estimating that the Senate bill would leave 22 million fewer Americans with health insurance by 2026 than would be covered by Obamacare. Paul said he thought the bill would keep too many provisions of the Affordable Care Act, President Barack Obama's signature health care law, in place. \"We keep 10 or 12 of the Obamacare regulations,\" Paul said. \"I'm concerned that the death spiral of Obamacare may get even worse in the Republican version.\" The Kentucky senator told CNN in a separate interview that he would not support the bill until he is convinced it would actually lower premiums. In an interview with CNN on Monday , Josh Holmes, McConnell's former chief of staff and campaign manager, affirmed his faith in the majority leader's ability to get the bill passed. \"He keeps a close watch on his fellow senators and makes observances about what they need,\" Holmes said. When asked Monday what he thinks of a potential vote Tuesday on a motion to proceed to the bill, Johnson expressed skepticism. \"If leader McConnell says failure is not an option, don't set yourself up for failure,\" he said. CNN's Lauren Fox contributed to this reporting."
}